In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

dataset = pd.DataFrame({'Movie Name':['Avengers Age of Ultron','Batman vs Superman',
                                      'Black Panthor','Thor','Avengers Civil War','Bahubali the conclusion'],
                        'Rating':[4.5,3,4.5,4,3.5,4],
                        'Year of Release':[2015,2016,2017,2013,2016,2017]})
display(dataset)

                Movie Name  Rating  Year of Release
0   Avengers Age of Ultron     4.5             2015
1       Batman vs Superman     3.0             2016
2            Black Panthor     4.5             2017
3                     Thor     4.0             2013
4       Avengers Civil War     3.5             2016
5  Bahubali the conclusion     4.0             2017

In [2]:
dataset.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['Movie Name', 'Rating', 'Year of Release'], dtype='object')]

In [4]:
dataset.dtypes

Movie Name          object
Rating             float64
Year of Release      int64
dtype: object

In [5]:
dataset.Rating.dtype

dtype('float64')

In [6]:
empty_dataset = pd.DataFrame({'Name':[],'Gender':[]})

In [7]:
empty_dataset.empty

True

In [8]:
dataset.empty

False

In [9]:
dataset.ndim

2

In [10]:
dataset.Rating.ndim

1

In [11]:
dataset.values

array([['Avengers Age of Ultron', 4.5, 2015],
       ['Batman vs Superman', 3.0, 2016],
       ['Black Panthor', 4.5, 2017],
       ['Thor', 4.0, 2013],
       ['Avengers Civil War', 3.5, 2016],
       ['Bahubali the conclusion', 4.0, 2017]], dtype=object)

In [12]:
marks = pd.DataFrame(np.random.randint(10,20,size=(5,5)), 
                     columns=['Maths','Science','Hindi','English','SST'], 
                     index=['Virat','Dhoni','Ronald','David','sunil chhetri'])

In [13]:
marks

               Maths  Science  Hindi  English  SST
Virat             12       15     15       13   14
Dhoni             16       14     17       17   12
Ronald            19       15     13       10   15
David             18       10     10       12   18
sunil chhetri     16       15     11       16   12

In [20]:
marks['MS'] = marks.apply(lambda x:x['Maths']+x['Science'],axis=1)

In [21]:
marks

               Maths  Science  Hindi  English  SST  MS
Virat             12       15     15       13   14  27
Dhoni             16       14     17       17   12  30
Ronald            19       15     13       10   15  34
David             18       10     10       12   18  28
sunil chhetri     16       15     11       16   12  31

In [25]:
marks.rolling(window=2).mean()

               Maths  Science  Hindi  English   SST    MS
Virat            NaN      NaN    NaN      NaN   NaN   NaN
Dhoni           14.0     14.5   16.0     15.0  13.0  28.5
Ronald          17.5     14.5   15.0     13.5  13.5  32.0
David           18.5     12.5   11.5     11.0  16.5  31.0
sunil chhetri   17.0     12.5   10.5     14.0  15.0  29.5